uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
// test_stm32f4_exti - the reference bench suite for the STM32F4's EXTI
// and the SYSCFG block its pin multiplexer lives in: the twenty-three
// lines, their triggers, the one pending register, the two masks, the
// software trigger, the multiplexer and the vectors - stm32f4/exti.hpp and
// stm32f4/syscfg.hpp.
//
// A test_<target>_<subject> suite is a menu of single-letter tests over
// the console, judged by brio's "ALL: N pass, M fail" grammar
// (util/testbench.hpp owns that grammar). It is a REFERENCE test: it is
// meant to keep passing through every later restructuring of the code
// under it.
//
// NOTHING TO WIRE, and nothing to press. Two stimuli, both inside the
// chip: the SOFTWARE TRIGGER (EXTI_SWIER, which needs no pad at all and
// reaches the peripheral wake-up lines as well as the pin ones), and A PAD
// THE PROGRAM DRIVES ITSELF - the board's own LED pin, because a GPIO in
// output mode still feeds its input buffer, so the EXTI sees the edges the
// program makes. The board's user button is configured and reported and
// nothing is expected of it; letter p, which is not part of z, waits for a
// press for whoever is at the desk.
//
// What is exercised, letter by letter:
//   a  SYSCFG: the gate that is closed out of reset, the memory map, the
//      compensation cell, the PHY selector where there is one
//   b  the EXTI's reset state and the multiplexer: every register at zero,
//      every line pointed at port A, the port codes, the refusals
//   c  the software trigger: the flag it raises with no pad, the bit that
//      stands until the flag is cleared, and what it does with the
//      interrupt masked
//   d  the latency from the SWIER store to the handler, in cycles
//   e  a pad the program drives: rising, falling, both, and analog mode
//      as the one state that blinds a line
//   f  the two masks: the flag that stands with the interrupt masked, and
//      the NVIC line as the second gate
//   g  an EXTI EVENT returning the core from WFE with no handler
//   h  the grouped vectors: two lines of one vector served in turn, and a
//      handler that leaves another vector's flag alone
//   i  one pin number is one line: the second claim refused, and stolen
//      on purpose
//   j  the lines above 15: each to its own vector, and the ones this part
//      has not got refusing every verb
//   k  the pending bit: rc_w1, and why a handler clears it FIRST
//   l  the board's button: configured, reported, and quiet
//   p  (not in z) wait for a press of the button
//
// build: boards = f429zi,f446re,f411ce
// build: monitor_speed = 115200

#include <stdint.h>

#include "stm32f4/clock.hpp"
#include "stm32f4/delay.hpp"
#include "stm32f4/exti.hpp"
#include "stm32f4/nvic.hpp"
#include "stm32f4/pin.hpp"
#include "stm32f4/platform.hpp"
#include "stm32f4/syscfg.hpp"
#include "stm32f4/ticker.hpp"
#include "stm32f4/usart.hpp"
#include "util/print.hpp"
#include "util/testbench.hpp"

#if defined(STM32F411xE)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 100'000'000, 25'000'000>;
#elif defined(STM32F429xx)
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000>;
#else
using SysClock = brio::Clock<brio::ClockSource::pll_hse, 180'000'000, 8'000'000, brio::HseMode::bypass>;
#endif
constexpr SysClock clock;

namespace {

using namespace brio;

using P = Stm32f4Platform<>;

// The two pads this suite touches, per board. The LED is the STIMULUS -
// an output the program drives, whose edges its own line sees - and the
// button is READ ONLY: its line is armed and reported, never expected to
// fire.
#if defined(STM32F429xx)
using Led = Pin<'G', 13>;
using Button = Pin<'A', 0>;
constexpr bool button_press_is_rising = true;    // B1 pulls the pad UP when pressed
constexpr PinPull button_pull = PinPull::down;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#elif defined(STM32F411xE)
using Led = Pin<'C', 13>;
using Button = Pin<'A', 0>;
constexpr bool button_press_is_rising = false;   // the key pulls the pad to ground
constexpr PinPull button_pull = PinPull::up;
constexpr UartPins console_pins{.tx = {'A', 9, PinFunction::af7}, .rx = {'A', 10, PinFunction::af7}};
constexpr uint8_t console_instance = 1;
#else
using Led = Pin<'A', 5>;
using Button = Pin<'C', 13>;
constexpr bool button_press_is_rising = false;   // B1 pulls the pad to ground
constexpr PinPull button_pull = PinPull::none;   // the board's own pull-up holds it high
constexpr UartPins console_pins{.tx = {'A', 2, PinFunction::af7}, .rx = {'A', 3, PinFunction::af7}};
constexpr uint8_t console_instance = 2;
#endif

using LedInt = ExtInt<Led>;
using ButtonInt = ExtInt<Button>;
static_assert(exti_lines_distinct<LedInt, ButtonInt>(),
              "the stimulus pad and the button must not share a line");

using Serial = Uart<console_instance, console_pins>;
constexpr Serial serial;

TestBench<Serial> bench;

// The lines this suite drives by software, none of them a pad's: line 1
// has a vector of its own (the latency and the pending-bit letters), lines
// 5 and 6 share EXTI9_5 and line 10 belongs to EXTI15_10 (the grouped
// vectors), and line 0 is the conflict pair's (PA0 against PB0).
constexpr uint8_t sw_line = 1;
constexpr uint8_t group_a = 5, group_b = 6;
constexpr uint8_t group_c = 10;

// ---- what the registers held before this program touched them ---------------
struct BootState {
    bool syscfg_gate = false;
    uint32_t imr = 0, emr = 0, rtsr = 0, ftsr = 0, swier = 0, pr = 0;
    uint32_t exticr[4] = {};
};
BootState boot;

// ---- handler bookkeeping -----------------------------------------------------
volatile uint32_t served_lines = 0;      ///< OR of every mask a handler saw
volatile uint16_t entries[24] = {};      ///< per-line handler entries
volatile uint16_t vector_entries = 0;    ///< handler calls, whichever vector
volatile uint32_t handler_val = 0;       ///< SysTick VAL sampled on entry
volatile uint16_t leftover_seen = 0;     ///< a foreign line's flag seen by a handler
volatile uint8_t clear_late = 0;         ///< the pending-bit letter's wrong handler
volatile uint16_t late_entries = 0;

