uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
[[gnu::always_inline]] inline void serve(IRQn_Type v) {
    handler_val = SysTick->VAL;
    const uint32_t fired = Exti::isr(Exti::vector_lines(v));
    served_lines |= fired;
    vector_entries = vector_entries + 1u;
    for (uint8_t l = 0; l < 24u; ++l) {
        if (Exti::served(fired, l)) {
            entries[l] = entries[l] + 1u;
        }
    }
    // What the vector could see but must not touch: another vector's flag.
    if ((Exti::pending() & ~Exti::vector_lines(v)) != 0u) {
        leftover_seen = leftover_seen + 1u;
    }
}

void reset_counters() {
    P::CriticalSection cs;
    served_lines = 0;
    vector_entries = 0;
    leftover_seen = 0;
    for (uint8_t l = 0; l < 24u; ++l) {
        entries[l] = 0;
    }
}

/// Every line this suite ever arms, back to reset, and the NVIC lines with
/// them - so no letter inherits another's state.
void quiet_everything() {
    for (uint8_t l = 0; l < 24u; ++l) {
        if (Exti::implemented(l)) {
            Nvic::disable(Exti::irq(l));
            (void)Exti::release(l);
            // The EXTI's flag is not the whole request: one that reached
            // the NVIC while its line was disabled is latched there and
            // outlives it (letter f measures exactly that).
            Nvic::clear_pending(Exti::irq(l));
        }
    }
    reset_counters();
}

/// Let the console's own transmitter fall silent: its interrupt would
/// otherwise wake every WFE and WFI below.
void console_drain() {
    const uint32_t t0 = Ticker::ticks();
    while (!Serial::tx_idle() && Ticker::ticks() - t0 < 200u) {
    }
}

// ---- a ruler ------------------------------------------------------------------
constexpr uint32_t cycles_per_us = SysClock::hz / 1'000'000u;

// A pulse the edge detector is guaranteed to see. Two adjacent BSRR stores
// are one AHB cycle apart and the detector samples at the APB2 clock: on
// one part of the family that pulse goes unseen, on another it is caught
// (letter f measures it). Every step whose proof depends on an edge being
// SEEN uses this one microsecond instead.
void pulse() {
    Led::set();
    (void)delay_us(clock, 1);
    Led::clear();
}

uint32_t systick_period() { return SysTick->LOAD + 1u; }

/// A cycle count that spans ticks: it wraps every few seconds, which is
/// longer than anything measured here.
uint32_t cycles_now() {
    const uint32_t period = systick_period();
    uint32_t t0 = 0, v = 0, t1 = 0;
    do {
        t0 = Ticker::ticks();
        v = SysTick->VAL;
        t1 = Ticker::ticks();
    } while (t0 != t1);
    return t0 * period + (period - 1u - v);
}

uint32_t cycles_to_us(uint32_t c) { return c / cycles_per_us; }

/// The distance between two VAL samples of one SysTick period.
uint32_t val_delta(uint32_t v0, uint32_t v1) {
    const uint32_t period = systick_period();
    return (v0 >= v1) ? (v0 - v1) : (v0 + period - v1);
}

// =============================================================================
// a - SYSCFG: the gate and the block
// =============================================================================
void ta_syscfg() {
    print(serial, "  SYSCFGEN at boot ", boot.syscfg_gate ? "OPEN" : "closed", ", memory map ",
          static_cast<uint8_t>(Syscfg::memory_map()), ", PHY select ",
          Syscfg::has_phy_select() ? "present" : "absent", crlf);
    bench.verdict("RCC_APB2ENR.SYSCFGEN is CLOSED out of reset - nothing but this "
                  "driver opens it",
                  !boot.syscfg_gate);
    bench.verdict("the first verb of the block opened it", Syscfg::clock());

    // Every verb opens the gate, not only the configuring ones: close it
    // and read the memory map.
    Syscfg::clock(false);
    const bool shut = !Syscfg::clock();
    const MemoryMap map = Syscfg::memory_map();
    bench.verdict("closing the gate is one RCC bit and it reads back shut", shut);
    bench.verdict("and a READ of the block opens it again (a verb never speaks to a "
                  "dead peripheral)",
                  Syscfg::clock());
    bench.verdict("the memory map at address 0 is the main flash the BOOT pins chose",
                  map == MemoryMap::main_flash);

    // The write half of the same rule: with the gate shut, a multiplexer
    // write still lands, because the verb opens the gate before storing.
    (void)Exti::steal(group_a, 'A');
    Syscfg::clock(false);
    const bool wrote = Exti::steal(group_a, 'B');
    const char after = Exti::selected(group_a);
    (void)Exti::steal(group_a, 'A');
    bench.verdict("a multiplexer write from a CLOSED gate lands, because the verb "
                  "opens the gate first",
                  wrote && after == 'B');

    // The compensation cell (9.1): off by default, and ready once powered.
    const bool cell_off = !Syscfg::compensation_cell();
    Syscfg::compensation_cell(true);
    uint16_t spins = 0;
    while (!Syscfg::compensation_ready() && spins < 1000u) {
        ++spins;
    }
    const bool ready = Syscfg::compensation_ready();
    Syscfg::compensation_cell(false);
    print(serial, "  the compensation cell reported ready after ", spins, " reads", crlf);
    bench.verdict("the I/O compensation cell is powered down by default", cell_off);
    bench.verdict("enabling it raises CMPCR.READY", ready);
    bench.verdict("and powering it down again is one bit", !Syscfg::compensation_cell());

    // The Ethernet PHY selector: a part fact, and the verb answers it.
    bench.verdict("the PHY selector answers exactly where the header declares it",
                  Syscfg::phy_rmii(false) == Syscfg::has_phy_select());
}

// =============================================================================
// b - the EXTI's reset state and the multiplexer
// =============================================================================
void tb_reset_and_mux() {
    print(serial, "  at boot IMR=", hex(boot.imr), " EMR=", hex(boot.emr), " RTSR=",
          hex(boot.rtsr), " FTSR=", hex(boot.ftsr), " SWIER=", hex(boot.swier), " PR=",
          hex(boot.pr), crlf);
    print(serial, "  EXTICR ", hex(boot.exticr[0]), " ", hex(boot.exticr[1]), " ",
          hex(boot.exticr[2]), " ", hex(boot.exticr[3]), ", implemented lines ",
          hex(Exti::implemented_mask), crlf);
    bench.verdict("every EXTI register comes up at zero - no line is unmasked, "
                  "triggered or pending behind the program's back",
                  (boot.imr | boot.emr | boot.rtsr | boot.ftsr | boot.swier | boot.pr) == 0u);
    bench.verdict("and every EXTICR field comes up at zero, which is port A",
                  (boot.exticr[0] | boot.exticr[1] | boot.exticr[2] | boot.exticr[3]) == 0u);

    // The multiplexer: a code per port, the letter's distance from 'A'.
    bench.verdict("the port codes are the contiguous A..K encoding",
                  exti_port_code('A') == 0 && exti_port_code('B') == 1 &&
                      exti_port_code('C') == 2 && exti_port_code('H') == 7);
    bench.verdict("a port this device has not got has no code", exti_port_code('Z') == 0xFFu);

    quiet_everything();
    const bool to_a = Exti::select(group_a, 'A') && Exti::selected(group_a) == 'A';
    const bool to_b = Exti::select(group_a, 'B') && Exti::selected(group_a) == 'B';
    const bool to_c = Exti::select(group_a, 'C') && Exti::selected(group_a) == 'C';
    bench.verdict("a free line follows the port it is pointed at", to_a && to_b && to_c);
    bench.verdict("a port with no code is refused and the line does not move",
                  !Exti::select(group_a, 'Z') && Exti::selected(group_a) == 'C');
    bench.verdict("a line above 15 has no multiplexer at all",
                  !Exti::select(16, 'A') && Exti::selected(16) == 0);
    (void)Exti::steal(group_a, 'A');

    // The reserve's vector map, against the vectors this image binds.
    bench.verdict("lines 0..4 have a vector each and 5..9 share one",
                  Exti::irq(0) == EXTI0_IRQn && Exti::irq(4) == EXTI4_IRQn &&
                      Exti::irq(5) == EXTI9_5_IRQn && Exti::irq(9) == EXTI9_5_IRQn);
    bench.verdict("lines 10..15 share the other",
                  Exti::irq(10) == EXTI15_10_IRQn && Exti::irq(15) == EXTI15_10_IRQn);
    bench.verdict("and each vector's mask is exactly its own lines",
                  Exti::vector_lines(EXTI9_5_IRQn) == 0x03E0u &&
                      Exti::vector_lines(EXTI15_10_IRQn) == 0xFC00u);
}

