uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
// =============================================================================
// c - the software trigger
// =============================================================================
void tc_software_trigger() {
    quiet_everything();

    // A line with NO trigger edge selected at all, armed in IMR, NVIC shut:
    // the flag is the whole observation.
    (void)Exti::interrupt(sw_line, true);
    const bool no_sense = Exti::sense(sw_line) == ExtiSense::none;
    (void)Exti::trigger(sw_line);
    const bool flagged = Exti::pending(sw_line);
    const bool bit_stands = Exti::triggered(sw_line);
    bench.verdict("a software trigger raises the flag on a line with no edge "
                  "selected and no pad behind it",
                  no_sense && flagged);
    bench.verdict("and SWIER's bit STANDS - it is not self-clearing on this family",
                  bit_stands);

    // A second trigger before the first is acknowledged does nothing: the
    // bit is already 1 and there is no 0 -> 1 transition to make.
    (void)Exti::trigger(sw_line);
    (void)Exti::clear(sw_line);
    const bool swier_cleared = !Exti::triggered(sw_line);
    const bool pr_cleared = !Exti::pending(sw_line);
    bench.verdict("clearing the pending bit is what clears SWIER", swier_cleared && pr_cleared);
    bench.verdict("and the second trigger of the pair left nothing behind (one "
                  "acknowledgement cleared both)",
                  !Exti::pending(sw_line));

    // ... and once acknowledged the line triggers again.
    (void)Exti::trigger(sw_line);
    bench.verdict("an acknowledged line triggers again", Exti::pending(sw_line));
    (void)Exti::clear(sw_line);

    // With the interrupt MASKED. 12.3.5 makes the pending bit conditional
    // on IMR for a SOFTWARE trigger, which is not what it says for an edge.
    (void)Exti::interrupt(sw_line, false);
    (void)Exti::trigger(sw_line);
    const bool masked_flag = Exti::pending(sw_line);
    const bool masked_swier = Exti::triggered(sw_line);
    print(serial, "  with IMR clear a software trigger left PR ", masked_flag ? "SET" : "clear",
          " and SWIER ", masked_swier ? "set" : "clear", crlf);
    bench.verdict("a software trigger with the interrupt masked raises no flag "
                  "(12.3.5's own condition)",
                  !masked_flag);
    bench.verdict("and the SWIER bit it wrote stands, waiting for a mask that never "
                  "came - so the line must be cleared before it is armed",
                  masked_swier);
    (void)Exti::clear(sw_line);
    quiet_everything();

    // The whole path, through the NVIC this time.
    (void)Exti::interrupt(sw_line, true);
    Nvic::enable(Exti::irq(sw_line));
    reset_counters();
    for (uint8_t k = 0; k < 5u; ++k) {
        (void)Exti::trigger(sw_line);
        (void)delay_us(clock, 20);
    }
    print(serial, "  five software triggers reached the handler ", vector_entries, " time(s)",
          crlf);
    bench.verdict("every software trigger reached the real vector and the handler's "
                  "clear let the next one through",
                  vector_entries == 5u && entries[sw_line] == 5u);
    quiet_everything();
}

// =============================================================================
// d - the latency from the store to the handler
// =============================================================================
void td_latency() {
    quiet_everything();
    (void)Exti::interrupt(sw_line, true);
    Nvic::enable(Exti::irq(sw_line));

    uint32_t worst = 0, best = 0xFFFFFFFFu, total = 0;
    const uint8_t rounds = 16;
    for (uint8_t k = 0; k < rounds; ++k) {
        reset_counters();
        const uint32_t v0 = SysTick->VAL;
        (void)Exti::trigger(sw_line);
        while (vector_entries == 0u) {
        }
        const uint32_t took = val_delta(v0, handler_val);
        total += took;
        if (took > worst) {
            worst = took;
        }
        if (took < best) {
            best = took;
        }
        (void)delay_us(clock, 20);
    }
    const uint32_t mean = total / rounds;
    print(serial, "  SWIER store to handler: ", best, "..", worst, " cycles, mean ", mean,
          " (", mean * 1000u / cycles_per_us, " ns at ", SysClock::hz / 1'000'000u, " MHz)", crlf);
    bench.verdict("the software trigger reaches its handler in under 200 cycles, "
                  "every round",
                  worst < 200u && best > 0u);
    quiet_everything();
}

// =============================================================================
// e - a pad the program drives
// =============================================================================
void te_pad() {
    quiet_everything();
    Led::output(false);
    (void)LedInt::select();
    bench.verdict("the line follows the LED pad's own port", LedInt::selected());
    (void)LedInt::arm(true);   // the flag, not the vector: the NVIC stays shut

    // Eight low-to-high and eight high-to-low transitions, counted through
    // the pending flag on each of the four senses.
    struct Leg {
        ExtiSense sense;
        uint8_t up = 0, down = 0;
    };
    Leg legs[4] = {{ExtiSense::none, 0, 0},
                   {ExtiSense::rising, 0, 0},
                   {ExtiSense::falling, 0, 0},
                   {ExtiSense::both, 0, 0}};
    for (Leg& leg : legs) {
        Led::clear();
        (void)LedInt::configure(leg.sense);
        (void)LedInt::clear();
        for (uint8_t k = 0; k < 8u; ++k) {
            Led::set();
            if (LedInt::pending()) {
                ++leg.up;
                (void)LedInt::clear();
            }
            Led::clear();
            if (LedInt::pending()) {
                ++leg.down;
                (void)LedInt::clear();
            }
        }
    }
    for (const Leg& leg : legs) {
        print(serial, "  sense ", static_cast<uint8_t>(leg.sense), ": ", leg.up, " up, ",
              leg.down, " down", crlf);
    }
    bench.verdict("A PAD IN OUTPUT MODE FEEDS ITS OWN LINE: eight rising edges the "
                  "program made, eight flags",
                  legs[1].up == 8u && legs[1].down == 0u);
    bench.verdict("a falling sense sees the other eight and no more",
                  legs[2].up == 0u && legs[2].down == 8u);
    bench.verdict("both edges is both bits, sixteen flags",
                  legs[3].up == 8u && legs[3].down == 8u);
    bench.verdict("and a line with no trigger selected sees nothing",
                  legs[0].up == 0u && legs[0].down == 0u);

    // Analog mode: the input buffer is off, so the pad disappears from its
    // line even though the program is still storing to it.
    (void)LedInt::configure(ExtiSense::both);
    Led::analog();
    (void)LedInt::clear();
    uint8_t blind = 0;
    for (uint8_t k = 0; k < 8u; ++k) {
        pulse();
        if (LedInt::pending()) {
            ++blind;
            (void)LedInt::clear();
        }
    }
    bench.verdict("ANALOG MODE IS THE ONE STATE THAT BLINDS A LINE: sixteen stores, "
                  "no edge",
                  blind == 0u);

    Led::output(false);
    quiet_everything();
}

