uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
// =============================================================================
// f - the two masks and the NVIC
// =============================================================================
void tf_masks() {
    quiet_everything();
    Led::output(false);
    (void)LedInt::select();
    (void)LedInt::configure(ExtiSense::rising);

    // Does the flag appear at all with the interrupt masked? The chapter
    // never says; the block diagram (figure 41) puts the interrupt mask
    // between the edge detector and the pending register.
    (void)LedInt::arm(false);
    (void)LedInt::clear();
    for (uint8_t k = 0; k < 8u; ++k) {
        pulse();
    }
    const bool flag_while_masked = LedInt::pending();
    (void)LedInt::arm(true);
    const bool resurrected = LedInt::pending();
    print(serial, "  with IMR clear, eight edges left the flag ",
          flag_while_masked ? "SET" : "clear", "; unmasking after them left it ",
          resurrected ? "SET" : "clear", crlf);
    bench.verdict("THE PENDING BIT EXISTS ONLY FOR AN UNMASKED INTERRUPT: eight "
                  "edges under the mask leave no trace, and unmasking does not "
                  "resurrect them",
                  !flag_while_masked && !resurrected);

    // So a line is WATCHED by arming the EXTI's mask and leaving the NVIC
    // line disabled: the flag stands and no handler runs.
    Nvic::disable(LedInt::irq());
    Nvic::clear_pending(LedInt::irq());
    reset_counters();
    (void)LedInt::clear();
    pulse();
    const bool watched = LedInt::pending() && vector_entries == 0u;
    const bool nvic_latched = Nvic::pending(LedInt::irq());
    bench.verdict("a line is WATCHED by arming the EXTI mask and leaving the NVIC "
                  "line shut: the flag stands, no handler runs",
                  watched);

    // ... but the request reached the NVIC all the same, and LATCHED there.
    // Clearing the EXTI's flag does not clear the NVIC's own pending bit.
    (void)LedInt::clear();
    const bool still_latched = Nvic::pending(LedInt::irq());
    Nvic::enable(LedInt::irq());
    (void)delay_us(clock, 50);
    const uint16_t after_enable = vector_entries;
    print(serial, "  the NVIC latched the watched line's request (", nvic_latched ? "yes" : "no",
          "), and it survived the flag's clear (", still_latched ? "yes" : "no",
          "): ", after_enable, " call(s) on enabling the line", crlf);
    bench.verdict("THE NVIC LATCHES THE REQUEST TOO, and clearing the EXTI's flag "
                  "does not clear it: opening the vector delivers one call for an "
                  "edge already acknowledged - Nvic::clear_pending is the other "
                  "half of a teardown",
                  nvic_latched && still_latched && after_enable == 1u);
    Nvic::disable(LedInt::irq());
    Nvic::clear_pending(LedInt::irq());
    reset_counters();
    (void)LedInt::clear();
    pulse();
    (void)LedInt::clear();
    Nvic::clear_pending(LedInt::irq());
    Nvic::enable(LedInt::irq());
    (void)delay_us(clock, 50);
    bench.verdict("and with both halves cleared, opening the vector delivers "
                  "nothing", vector_entries == 0u);

    // How narrow a pulse does the detector see? Two adjacent stores are the
    // narrowest the program can make; whether they register is a fact of
    // the part and its bus timing, reported and not judged.
    Nvic::disable(LedInt::irq());
    Nvic::clear_pending(LedInt::irq());
    (void)LedInt::clear();
    uint8_t narrow = 0;
    for (uint8_t k = 0; k < 8u; ++k) {
        Led::set();
        Led::clear();
        if (LedInt::pending()) {
            ++narrow;
            (void)LedInt::clear();
        }
    }
    print(serial, "  a pulse of two adjacent stores (one AHB cycle at ", SysClock::hz / 1'000'000u,
          " MHz) is seen ", narrow, " times in 8; the suite pulses one microsecond", crlf);
    Nvic::clear_pending(LedInt::irq());
    Nvic::enable(LedInt::irq());

    // With everything open, every edge is a handler call.
    reset_counters();
    for (uint8_t k = 0; k < 8u; ++k) {
        Led::set();
        (void)delay_us(clock, 10);
        Led::clear();
        (void)delay_us(clock, 10);
    }
    print(serial, "  eight rising edges, ", vector_entries, " handler calls", crlf);
    bench.verdict("eight edges through the whole path are eight handler calls",
                  vector_entries == 8u && entries[LedInt::line] == 8u);

    quiet_everything();
    Led::output(false);
}

// =============================================================================
// g - an EXTI event out of WFE
// =============================================================================
void tg_event() {
    quiet_everything();
    Led::output(false);
    (void)LedInt::select();
    (void)LedInt::configure(ExtiSense::rising);

    // The CPU event: no NVIC line, no handler, no flag to clear (12.2.3).
    const bool event_only = LedInt::event(true) && LedInt::event() && !LedInt::armed();

    // THE MEASUREMENT IS A TIME, and two traps stand in its way. An
    // EXCEPTION ENTRY sets this core's event register just as SEV and the
    // EXTI do, so a loop that ends by returning from SysTick_Handler leaves
    // it SET and the next WFE returns whatever the EXTI did; and every byte
    // of a console line is an interrupt, which returns a WFE too. So: drain
    // the console, align to the tick, clear the event register with SEV +
    // WFE, make the edge, sleep - and print afterwards.
    console_drain();
    uint32_t t0 = Ticker::ticks();
    while (Ticker::ticks() == t0) {
    }
    __SEV();
    __WFE();                    // consumes the register's own set bit
    Led::set();                 // the edge
    const uint32_t c0 = cycles_now();
    __WFE();
    const uint32_t event_us = cycles_to_us(cycles_now() - c0);
    const bool event_flag = LedInt::pending();

    // The control: the same edge with the event masked, so only the tick
    // can end the wait.
    (void)LedInt::event(false);
    Led::clear();
    t0 = Ticker::ticks();
    while (Ticker::ticks() == t0) {
    }
    __SEV();
    __WFE();
    Led::set();
    const uint32_t c1 = cycles_now();
    __WFE();
    const uint32_t control_us = cycles_to_us(cycles_now() - c1);

