uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
    print(serial, "  WFE after an edge: ", event_us, " us with the CPU event unmasked, ",
          control_us, " us with it masked (the tick)", crlf);
    bench.verdict("EMR is set and IMR is not - an event line has no NVIC side",
                  event_only);
    bench.verdict("AN EXTI EVENT RETURNS THE CORE FROM WFE with no handler and no "
                  "vector", event_us < 100u);
    bench.verdict("with the event masked the same edge does nothing and the WFE "
                  "waits for the next tick", control_us > 100u);
    bench.verdict("and a CPU event leaves NO pending bit to acknowledge", !event_flag);

    quiet_everything();
    Led::output(false);
}

// =============================================================================
// h - the grouped vectors
// =============================================================================
void th_grouped() {
    quiet_everything();

    // Two lines of one vector, each pointed at a different port - the
    // multiplexer's choice, even though the stimulus is the software
    // trigger and no pad is involved.
    (void)Exti::select(group_a, 'A');
    (void)Exti::select(group_b, 'B');
    (void)Exti::interrupt(group_a, true);
    (void)Exti::interrupt(group_b, true);
    Nvic::enable(EXTI9_5_IRQn);
    bench.verdict("two lines of the same vector, pointed at two different ports",
                  Exti::selected(group_a) == 'A' && Exti::selected(group_b) == 'B' &&
                      Exti::irq(group_a) == Exti::irq(group_b));

    reset_counters();
    for (uint8_t k = 0; k < 4u; ++k) {
        (void)Exti::trigger(group_a);
        (void)delay_us(clock, 20);
        (void)Exti::trigger(group_b);
        (void)delay_us(clock, 20);
    }
    print(serial, "  EXTI9_5: ", vector_entries, " calls, line ", group_a, " x",
          entries[group_a], ", line ", group_b, " x", entries[group_b], crlf);
    bench.verdict("A GROUPED VECTOR IS A DISPATCHER: eight triggers on two lines, "
                  "eight calls, four each",
                  vector_entries == 8u && entries[group_a] == 4u && entries[group_b] == 4u);

    // Both at once: one call, two lines in the mask.
    reset_counters();
    {
        P::CriticalSection cs;
        (void)Exti::trigger(group_a);
        (void)Exti::trigger(group_b);
    }
    (void)delay_us(clock, 50);
    print(serial, "  two lines raised together: ", vector_entries, " call(s), mask ",
          hex(served_lines), crlf);
    bench.verdict("two lines raised inside one critical section are ONE call with "
                  "both lines in the mask",
                  vector_entries == 1u && entries[group_a] == 1u && entries[group_b] == 1u);

    // ONE PENDING REGISTER, SEPARATE HANDLERS. Leave a line of the OTHER
    // group standing with its vector shut, and make this one run: its body
    // must see the foreign flag and leave it exactly where it found it.
    (void)Exti::interrupt(group_c, true);
    Nvic::disable(EXTI15_10_IRQn);
    (void)Exti::trigger(group_c);
    const bool foreign_set = Exti::pending(group_c);
    reset_counters();
    (void)Exti::trigger(group_a);
    (void)delay_us(clock, 50);
    print(serial, "  with line ", group_c, " standing, EXTI9_5 ran ", vector_entries,
          " time(s) and saw a foreign flag ", leftover_seen, " time(s)", crlf);
    bench.verdict("a line of another vector stands untouched while this one runs",
                  foreign_set && leftover_seen == 1u && Exti::pending(group_c));
    bench.verdict("and the handler served only its own line",
                  vector_entries == 1u && entries[group_a] == 1u && entries[group_c] == 0u);

    // And the other vector, opened, takes it.
    reset_counters();
    Nvic::enable(EXTI15_10_IRQn);
    (void)delay_us(clock, 50);
    bench.verdict("the other vector serves it as soon as its NVIC line opens",
                  vector_entries == 1u && entries[group_c] == 1u);

    quiet_everything();
}

// =============================================================================
// i - one pin number is one line
// =============================================================================
void ti_one_line_per_number() {
    quiet_everything();

    using PadA = ExtInt<Pin<'A', 0>>;
    using PadB = ExtInt<Pin<'B', 0>>;
    static_assert(PadA::line == PadB::line, "the whole point: one line, two pads");
    static_assert(!exti_lines_distinct<PadA, PadB>(),
                  "and the application-level check says so at compile time");

    // Nobody is using the line: the second claim is free.
    bench.verdict("a line nobody uses changes hands freely",
                  PadA::select() && PadA::selected() && PadB::select() && PadB::selected());

    // Now port A takes it and arms it - and the claim is refused.
    (void)PadA::select();
    (void)PadA::configure(ExtiSense::rising);
    (void)PadA::arm(true);
    const bool in_use = Exti::in_use(PadA::line);
    const bool refused = !PadB::select();
    const bool kept = PadA::selected();
    bench.verdict("a line IN USE (a sense, an interrupt or an event) is not handed "
                  "to another port behind its owner's back",
                  in_use && refused && kept);

    // The deliberate override says what it is doing in its name.
    const bool stolen = PadB::steal() && PadB::selected();
    bench.verdict("steal() takes it anyway - the verb an application writes when it "
                  "means to",
                  stolen);
    bench.verdict("and the line's sense and mask did not move with the port: the "
                  "multiplexer is the only thing that changed",
                  Exti::sense(PadA::line) == ExtiSense::rising && Exti::interrupt(PadA::line));

    // Released, it is free again.
    (void)Exti::release(PadA::line);
    bench.verdict("a released line is free for the next claim",
                  !Exti::in_use(PadA::line) && PadA::select());

    quiet_everything();
}

// =============================================================================
// j - the lines above 15
// =============================================================================
void tj_peripheral_lines() {
    quiet_everything();
    print(serial, "  implemented lines ", hex(Exti::implemented_mask), ": 16 PVD, 17 RTC "
          "alarm, 18 OTG FS wake, 19 Ethernet wake, 20 OTG HS wake, 21 RTC tamper, 22 "
          "RTC wake", crlf);

    // Every line this part has above 15 whose vector this image binds,
    // software-triggered to ITS OWN vector: the wake-up lines are ordinary
    // edge-detected lines here, with a trigger, a flag and a SWIER bit.
    static const uint8_t own_vector[] = {16, 17, 18, 21, 22};
    uint8_t reached = 0, expected = 0;
    for (uint8_t l : own_vector) {
        if (!Exti::implemented(l)) {
            continue;
        }
        ++expected;
        (void)Exti::interrupt(l, true);
        Nvic::enable(Exti::irq(l));
        reset_counters();
        (void)Exti::trigger(l);
        (void)delay_us(clock, 50);
        if (vector_entries == 1u && entries[l] == 1u) {
            ++reached;
        }
        Nvic::disable(Exti::irq(l));
        (void)Exti::release(l);
    }
    print(serial, "  ", reached, " of ", expected, " peripheral lines reached their own "
          "vector", crlf);
    bench.verdict("each line above 15 that this part has reaches a vector of its "
                  "own, and a software trigger is enough to prove it",
                  expected >= 4u && reached == expected);

