uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
    // Line 20 is the USB OTG HS wake-up: present on the parts with that
    // controller, and this image binds no handler for it - so it is judged
    // by its flag, with the NVIC shut.
    if (Exti::implemented(20)) {
        (void)Exti::interrupt(20, true);
        (void)Exti::trigger(20);
        bench.verdict("the USB OTG HS wake-up line flags like any other", Exti::pending(20));
        (void)Exti::release(20);
    } else {
        bench.verdict("this part has no USB OTG HS, so line 20 refuses every verb",
                      !Exti::interrupt(20, true) && !Exti::trigger(20) && !Exti::pending(20));
    }

    // And a line this part has not got answers false to everything rather
    // than writing a bit into a reserved field.
    const uint8_t absent = Exti::implemented(19) ? 24u : 19u;
    bench.verdict("a line this device does not implement refuses the sense, the "
                  "trigger, the mask and the release",
                  !Exti::sense(absent, ExtiSense::rising) && !Exti::trigger(absent) &&
                      !Exti::interrupt(absent, true) && !Exti::release(absent) &&
                      Exti::irq(absent) == NonMaskableInt_IRQn);

    quiet_everything();
}

// =============================================================================
// k - the pending bit, and why a handler clears it first
// =============================================================================
void tk_pending() {
    quiet_everything();
    (void)Exti::interrupt(sw_line, true);

    // rc_w1: a zero leaves the bit alone, a one clears it.
    (void)Exti::trigger(sw_line);
    Exti::clear_lines(0u);
    const bool zero_kept = Exti::pending(sw_line);
    Exti::clear_lines(~(1UL << sw_line) & Exti::implemented_mask);
    const bool others_kept = Exti::pending(sw_line);
    const uint32_t v0 = SysTick->VAL;
    (void)Exti::clear(sw_line);
    const bool gone = !Exti::pending(sw_line);
    const uint32_t took = val_delta(v0, SysTick->VAL);
    print(serial, "  the clear and its read-back took ", took, " cycles", crlf);
    bench.verdict("PR is rc_w1: a zero written over a standing flag leaves it, and "
                  "so does a one written at every OTHER line",
                  zero_kept && others_kept);
    bench.verdict("a one clears it, and the read that follows the store already "
                  "sees it gone",
                  gone);

    // WHY THE ISR BODY CLEARS FIRST. The errata item filed under the RTC
    // (ES0206 2.9.3 and its twins) says the effective clear is DELAYED with
    // respect to the store: a handler that clears LAST returns while the
    // request still stands, and the NVIC enters it again.
    Nvic::enable(Exti::irq(sw_line));
    reset_counters();
    late_entries = 0;
    clear_late = 1;
    (void)Exti::trigger(sw_line);
    (void)delay_us(clock, 200);
    const uint16_t late = late_entries;
    clear_late = 0;
    (void)Exti::clear(sw_line);

    reset_counters();
    (void)Exti::trigger(sw_line);
    (void)delay_us(clock, 200);
    const uint16_t early = vector_entries;

    print(serial, "  one trigger: ", late, " entries clearing LAST, ", early,
          " clearing first", crlf);
    bench.verdict("clearing first serves one trigger exactly once", early == 1u);
    bench.verdict("and clearing it as the handler's LAST store is served once too "
                  "here - the delay the errata warns of did not outlive the "
                  "exception return on this part, which is a measurement and not a "
                  "licence: the driver clears first",
                  late == 1u);

    quiet_everything();
}

// =============================================================================
// l - the board's button
// =============================================================================
void tl_button() {
    quiet_everything();
    (void)ButtonInt::claim(button_pull);
    (void)ButtonInt::configure(button_press_is_rising ? ExtiSense::rising : ExtiSense::falling);
    (void)ButtonInt::arm(true);
    Nvic::enable(ButtonInt::irq());
    reset_counters();

    print(serial, "  the button is on line ", ButtonInt::line, " of port ", ButtonInt::port,
          ", vector ", static_cast<uint8_t>(ButtonInt::irq()), "; a press is a ",
          button_press_is_rising ? "RISING" : "FALLING", " edge, the pad reads ",
          Button::read() ? "high" : "low", " at rest", crlf);
    bench.verdict("the pad rests at the level a press moves away from",
                  Button::read() == !button_press_is_rising);
    bench.verdict("the line is armed, on its own port, with the sense a press makes",
                  ButtonInt::selected() && ButtonInt::armed() &&
                      ButtonInt::sense() ==
                          (button_press_is_rising ? ExtiSense::rising : ExtiSense::falling));

    const uint32_t t0 = Ticker::ticks();
    while (Ticker::ticks() - t0 < 50u) {
    }
    bench.verdict("and it raises nothing in 50 ms with nobody pressing", vector_entries == 0u);
    quiet_everything();
}

// =============================================================================
// p - wait for a press (not part of z)
// =============================================================================
void tp_press() {
    quiet_everything();
    (void)ButtonInt::claim(button_pull);
    (void)ButtonInt::configure(ExtiSense::both);
    (void)ButtonInt::arm(true);
    Nvic::enable(ButtonInt::irq());
    reset_counters();

    print(serial, "  press the button (5 s) ...", crlf);
    const uint32_t t0 = Ticker::ticks();
    while (Ticker::ticks() - t0 < 5000u && vector_entries == 0u) {
    }
    const uint16_t seen = vector_entries;
    print(serial, "  ", seen, " edge(s), the pad now reads ", Button::read() ? "high" : "low",
          crlf);
    bench.verdict("a press reached the handler", seen > 0u);
    quiet_everything();
}

void banner() {
    print(serial, crlf, "test_stm32f4_exti - the EXTI's lines, triggers, flags, masks "
          "and vectors, and SYSCFG's multiplexer", crlf);
    bench.menu();
}

