uliano/brio/stm32f4/src/apps/test_stm32f4_exti.cpp
} // namespace

// ---- target glue ------------------------------------------------------------
#if defined(STM32F446xx)
extern "C" void USART2_IRQHandler() { (void)Serial::isr(); }
#else
extern "C" void USART1_IRQHandler() { (void)Serial::isr(); }
#endif
extern "C" void SysTick_Handler() { brio::Ticker::tick(); }

extern "C" void EXTI0_IRQHandler() { serve(EXTI0_IRQn); }
extern "C" void EXTI1_IRQHandler() {
    if (clear_late == 0u) {
        serve(EXTI1_IRQn);
        return;
    }
    // The wrong order, on purpose: everything the handler does comes
    // FIRST, and the clear is its last store before the return.
    late_entries = late_entries + 1u;
    if (late_entries > 4u) {   // never spin, whatever the silicon does
        clear_late = 0;
    }
    brio::Exti::clear_lines(brio::Exti::vector_lines(EXTI1_IRQn));
}
extern "C" void EXTI4_IRQHandler() { serve(EXTI4_IRQn); }
extern "C" void EXTI9_5_IRQHandler() { serve(EXTI9_5_IRQn); }
extern "C" void EXTI15_10_IRQHandler() { serve(EXTI15_10_IRQn); }
extern "C" void PVD_IRQHandler() { serve(PVD_IRQn); }
extern "C" void RTC_Alarm_IRQHandler() { serve(RTC_Alarm_IRQn); }
extern "C" void TAMP_STAMP_IRQHandler() { serve(TAMP_STAMP_IRQn); }
extern "C" void RTC_WKUP_IRQHandler() { serve(RTC_WKUP_IRQn); }
extern "C" void OTG_FS_WKUP_IRQHandler() { serve(OTG_FS_WKUP_IRQn); }

int main() {
    // What the silicon held before a line of this program ran. SYSCFG's
    // gate is read out of RCC, so reading it does not open it; the EXTI has
    // no gate at all.
    boot.syscfg_gate = brio::Syscfg::clock();
    boot.imr = brio::Exti::regs().IMR;
    boot.emr = brio::Exti::regs().EMR;
    boot.rtsr = brio::Exti::regs().RTSR;
    boot.ftsr = brio::Exti::regs().FTSR;
    boot.swier = brio::Exti::regs().SWIER;
    boot.pr = brio::Exti::regs().PR;
    for (uint8_t i = 0; i < 4u; ++i) {
        boot.exticr[i] = brio::Syscfg::regs().EXTICR[i];
    }

    const bool clock_ok = SysClock::init();
    const bool serial_ok = Serial::init(clock, 115200);
    const bool tick_ok = brio::Ticker::init(clock);
    Led::output();
    brio::enable_interrupts();

    bench.letter('a', "SYSCFG: the gate, the map, the compensation cell", ta_syscfg);
    bench.letter('b', "the EXTI's reset state and the multiplexer", tb_reset_and_mux);
    bench.letter('c', "the software trigger", tc_software_trigger);
    bench.letter('d', "the latency from the SWIER store to the handler", td_latency);
    bench.letter('e', "a pad the program drives, and the four senses", te_pad);
    bench.letter('f', "the two masks and the NVIC line", tf_masks);
    bench.letter('g', "an EXTI event out of WFE", tg_event);
    bench.letter('h', "the grouped vectors", th_grouped);
    bench.letter('i', "one pin number is one line", ti_one_line_per_number);
    bench.letter('j', "the lines above 15", tj_peripheral_lines);
    bench.letter('k', "the pending bit, and why a handler clears it first", tk_pending);
    bench.letter('l', "the board's button, armed and quiet", tl_button);
    bench.letter('p', "wait for a press of the button", tp_press, false);

    if (serial_ok) {
        brio::print(serial, brio::crlf, "boot: clk=", clock_ok ? "PLL" : "FAILED", " tick=",
                    tick_ok ? "SysTick" : "FAILED", brio::crlf);
        banner();
        bench.prompt();
    }

    for (;;) {
        uint8_t c = 0;
        if (!Serial::read_byte(c)) {
            continue;
        }
        if (c == '\r' || c == '\n') {
            continue;
        }
        brio::print(serial, static_cast<char>(c), brio::crlf);
        if (c == '?') {
            banner();
        } else if (!bench.handle(static_cast<char>(c))) {
            brio::print(serial, "unknown letter (? for the menu)", brio::crlf);
        }
        bench.prompt();
    }
}
